[{"title":"Effective Core Java ","link":"https://informator.se/utbildningar/systemutveckling/java/effective-core-java-","date":"22 Okt 2019","duration":"4","price":3130,"info":"The course adheres to the guide lines defined by Joshua Bloch in ”Effective Java”, and systematically covers a number of areas within software development using core Java APIs. You will learn how to follow best practices in order to produce high quality code in terms of performance, maintainability and readability.","city":"Stockholm","country":"Sweden"},{"title":"Building Microservices with Spring Boot","link":"https://informator.se/utbildningar/systemutveckling/java/building-microservices-with-spring-boot","date":"18 Nov 2019","duration":"3","price":1891,"info":"In this hands-on 3-day workshop you will learn the fundamentals of Microservices and how to design and implement Microservices using Spring Boot and Spring Cloud. We will also look at containerizing applications with docker, scheduling and orchestration with Docker Swarm and Kubernetes.","city":"Stockholm","country":"Sweden"},{"title":"Effective Java Enterprise Edition (JEE7)","link":"https://informator.se/utbildningar/systemutveckling/java/effective-java-enterprise-edition-jee7","date":"11 Nov 2019","duration":"3","price":2560,"info":"Java Enterprise Edition (Java EE) is the industry standard for enterprise Java computing. You can use the Java EE platform to develop an enterprise Java application quick and easy. The platform has several specifications such as JSF, EJB, JPA, JTA and more.","city":"Stockholm","country":"Sweden"},{"title":"JVM Internals and Performance Tuning ","link":"https://informator.se/utbildningar/systemutveckling/java/jvm-internals-and-performance-tuning-","date":"21 Nov 2019","duration":"2","price":2375,"info":"This 2-day training dives deep into the JVM internals and tool set offered by JVM’s eco-system. It also describes possible scenarios that may arise during production system support.","city":"Stockholm","country":"Sweden"},{"link":"https://skillsmatter.com//courses/602-real-world-kotlin-development-workshop","title":"Real World Kotlin Development Workshop","date":"22 Oct 2019","duration":2,"price":1495,"info":"Need a lighter, pragmatic and more concise way of building code, but have an existing Java codebase? Wish there was a better way to avoid NullPointerExceptions? Enjoy the benefits of first-class tooling and industry support? Join this workshop to learn the developer-friendly features of Kotlin.","city":"London","country":"UK"},{"link":"https://skillsmatter.com//courses/651-migrating-to-java-11","title":"Migrating to Java 11 with Ben Evans","date":"28 Oct 2019","duration":2,"price":1430,"info":"New releases are only daunting to those who aren’t ready to embrace them. With updates for Oracle JDK 8 having ended in January 2019, now is the optimum time to get up to date with the Java landscape beyond version 8,  so you can ensure the smooth migration of your projects. Join Java Champion Ben Evans, to learn how the release cycle has changed and why Java 11 is the natural upgrade from Java 8. Gain a deep understanding of the new Java language, library and JVM features, including enhanced type inference, Nestmates, Compact Strings, VarHandles, and JShell. You'll also get to grips with the new JIT compiler, Graal, and will learn how Graal is realted to the new polyglot virtual machine, GraalVM.","city":"London","country":"UK"},{"link":"https://skillsmatter.com//courses/103-spring-framework","title":"Pivotal's Core Spring","date":"4 Nov 2019","duration":4,"price":2295,"info":"Core Spring is the four-day flagship Spring Framework and Spring Boot training. In this course, students build a Spring-powered Java application that demonstrates the Spring Framework and other Spring technologies like Spring Boot, Spring Data, Spring Security and microservices in an intensely productive, hands-on setting.","city":"London","country":"UK"},{"link":"https://skillsmatter.com//courses/653-deep-within-jvm","title":"Ben Evans' Deep within the JVM","date":"2 Dec 2019","duration":2,"price":1450,"info":"Have you ever wondered how the JVM really works? Or how the overall performance behaviour of your applications is built up? Or what you can do to code in a more performant manner? Or what advanced techniques exist for applications that want to push the boundaries of the JVM?\n\nJoin Ben Evans, Java Champion, author, educator and expert, for this masterclass, which will give you a guided tour deep within the JVM.","city":"London","country":"UK"},{"link":"https://skillsmatter.com//courses/513-modern-development-with-java","title":"Modern development with Java ","date":"9 Dec 2019","duration":3,"price":1995,"info":"Java 8 was the largest update to Java in it's history. Java 9 and beyond has brought us Reactive and Asynchronous programming. This isn't your parents' Java anymore. \n\nModern Java  has incorporated the best ideas from functional programming to help us write better, easier to read, more flexible code that scales to multicore. Join this hands-on Modern Java course and learn to write more flexible and concise code, using the latest practices and tools and cutting edge programming approaches.","city":"London","country":"UK"}]